<?php

return array (
  'accepted' => 'يجب قبول السمة:.',
  'accepted_if' => 'يجب قبول السمة: عندما: الآخر هو: القيمة.',
  'active_url' => 'السمة: ليست عنوان URL صالحًا.',
  'after' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ.',
  'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ أو مساويًا له.',
  'alpha' => 'يجب أن تحتوي السمة على أحرف فقط.',
  'alpha_dash' => 'يجب أن تحتوي السمة: على أحرف وأرقام وشرطات وشرطات سفلية فقط.',
  'alpha_num' => 'يجب أن تحتوي السمة: على أحرف وأرقام فقط.',
  'array' => 'يجب أن تكون السمة مصفوفة.',
  'attributes' => 
  array (
  ),
  'before' => 'يجب أن تكون السمة تاريخًا قبل: التاريخ.',
  'before_or_equal' => 'يجب أن تكون السمة تاريخًا يسبق: التاريخ أو مساويًا له.',
  'between' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على ما بين: min و: max items.',
    'file' => 'يجب أن تكون السمة: بين: min و: max كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: بين: min و: max.',
    'string' => 'يجب أن تكون السمة: بين: min و: max من الأحرف.',
  ),
  'boolean' => 'يجب أن يكون حقل السمة صحيحًا أو خطأً.',
  'confirmed' => 'تأكيد السمة غير مطابق.',
  'current_password' => 'كلمة المرور غير صحيحة.',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'رسالة مخصصة',
    ),
  ),
  'date' => 'السمة: ليست تاريخًا صالحًا.',
  'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا لـ: التاريخ.',
  'date_format' => 'السمة: لا تطابق التنسيق: format.',
  'different' => 'يجب أن يكون: السمة و: الآخر مختلفين.',
  'digits' => 'يجب أن تكون السمة: أرقامًا.',
  'digits_between' => 'يجب أن تكون السمة: بين: min و: max digits.',
  'dimensions' => 'السمة لها أبعاد صورة غير صالحة.',
  'distinct' => 'يحتوي حقل السمة: على قيمة مكررة.',
  'email' => 'يجب أن تكون السمة: عنوان بريد إلكتروني صالحًا.',
  'ends_with' => 'يجب أن تنتهي السمة: بأحد القيم التالية:',
  'exists' => 'السمة المحددة: غير صالحة.',
  'file' => 'يجب أن تكون السمة: ملفًا.',
  'filled' => 'يجب أن يحتوي حقل السمة على قيمة.',
  'gt' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أكبر من: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من: القيمة.',
    'string' => 'يجب أن تكون السمة: أكبر من: قيمة  الأحرف.',
  ),
  'gte' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على قيمة العناصر أو أكثر.',
    'file' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون السمة: أكبر من أو تساوي: أحرف القيمة.',
  ),
  'image' => 'يجب أن تكون السمة صورة.',
  'in' => 'السمة المحددة: غير صالحة.',
  'in_array' => 'حقل السمة: غير موجود في: أخرى.',
  'integer' => 'يجب أن تكون السمة عددًا صحيحًا.',
  'ip' => 'يجب أن تكون السمة: عنوان IP صالحًا.',
  'ipv4' => 'يجب أن تكون السمة: عنوان IPv4 صالحًا.',
  'ipv6' => 'يجب أن تكون السمة عنوان IPv6 صالحًا.',
  'json' => 'يجب أن تكون السمة: سلسلة JSON صالحة.',
  'lt' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على أقل من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من: value كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من: أحرف القيمة.',
  ),
  'lte' => 
  array (
    'array' => 'يجب ألا تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من أو تساوي: value كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من أو تساوي: أحرف القيمة.',
  ),
  'max' => 
  array (
    'array' => 'يجب ألا تحتوي السمة: على أكثر من: max items.',
    'file' => 'يجب ألا تكون السمة: أكبر من: كحد أقصى كيلوبايت.',
    'numeric' => 'يجب ألا تكون السمة: أكبر من: max.',
    'string' => 'يجب ألا تكون السمة: أكبر من: الحد الأقصى من الأحرف.',
  ),
  'mimes' => 'يجب أن تكون السمة: ملفًا من النوع: القيم.',
  'mimetypes' => 'يجب أن تكون السمة: ملفًا من النوع: القيم.',
  'min' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على الأقل على: min من العناصر.',
    'file' => 'يجب أن تكون السمة: على الأقل: دقيقة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: min.',
    'string' => 'يجب ألا تقل السمة: عن: min حرفًا.',
  ),
  'multiple_of' => 'يجب أن تكون السمة من مضاعفات: القيمة.',
  'not_in' => 'السمة المحددة: غير صالحة.',
  'not_regex' => 'تنسيق السمة: غير صالح.',
  'numeric' => 'يجب أن تكون السمة رقمًا.',
  'password' => 'كلمة المرور غير صحيحة.',
  'present' => 'يجب أن يكون حقل السمة موجودًا.',
  'prohibited' => 'حقل السمة: محظور.',
  'prohibited_if' => 'يُحظر حقل السمة: عندما: الآخر هو: القيمة.',
  'prohibited_unless' => 'يُحظر حقل السمة: إلا إذا كان الآخر في: القيم.',
  'prohibits' => 'يحظر حقل السمة: وجود الآخرين.',
  'regex' => 'تنسيق السمة: غير صالح.',
  'required' => ': حقل السمة مطلوب.',
  'required_if' => 'يكون حقل السمة مطلوبًا عندما: الآخر هو: القيمة.',
  'required_unless' => 'حقل السمة مطلوب إلا إذا كان الآخر في: قيم.',
  'required_with' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_with_all' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_without' => 'يكون حقل السمة مطلوبًا عندما: القيم غير موجودة.',
  'required_without_all' => 'يكون حقل السمة مطلوبًا في حالة عدم وجود أي من قيم:.',
  'same' => 'يجب أن تتطابق السمة: و: يجب أن يتطابق الآخر..',
  'size' => 
  array (
    'array' => 'The :attribute must contain :size items.',
    'file' => 'The :attribute must be :size kilobytes.',
    'numeric' => 'The :attribute must be :size.',
    'string' => 'The :attribute must be :size characters.',
  ),
  'starts_with' => 'يجب أن تبدأ السمة: بأحد القيم التالية:',
  'string' => 'The :attribute must be a string.',
  'timezone' => 'The :attribute must be a valid timezone.',
  'unique' => 'The :attribute has already been taken.',
  'uploaded' => 'The :attribute failed to upload.',
  'url' => 'The :attribute must be a valid URL.',
  'uuid' => 'The :attribute must be a valid UUID.',
);
